using Banks.Entities;

/*internal class Program
{
    private static void Main(string[] args)
    {
        ICentralBank centralBank = new CentralBank();
        Console.WriteLine("1. Зарегестрировать банк\n" +
                          "2. Создать базового клиента(Только имя и фамилия)\n" +
                          "3. Создать Про-версию клиента(Имя,фамилия,адресс и номер паспорта\n" +
                          "4. Добавить клиенту данные адресса\n" +
                          "5. Добавить клиенту данные паспорта\n" +
                          "6. Создать дебетовый счет клиенту\n" +
                          "7. Создать кредитный счет клиенту\n" +
                          "8. Создать депозитный счет клиенту\n" +
                          "9. Поменять процентную ставку в банке\n" +
                          "10. Поменять коммисию банка для кредитных счетов\n" +
                          "11. Поменять лимитный перевод для неверефицованных аккаунтов\n" +
                          "12. Подписаться на уведомления от банка\n" +
                          "13. Отписаться от уведомлений от банка\n" +
                          "14. Пополнить баланс счета\n" +
                          "15. Вывести деньги с счета\n" +
                          "16. Отменить транзакцию\n" +
                          "17. Перевести деньги с одного счета на другой\n" +
                          "18. Проматать время на какое то количество часов\n" +
                          "19. Промотать время на какое то количество месяцев\n");
        string inputData = Console.ReadLine();
        switch (inputData)
        {
            case "1":
                Console.WriteLine("Введите Название банка");
                string nameOfBank = Console.ReadLine();
                Console.WriteLine("Введите");
                break;
        }
    }
}*/
